tests/pure_openfoam_cases/cbox/sim0/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

scale   1;

vertices
(
    (0 0 0)
    (1 0 0)
    (1 1 0)
    (0 1 0)
    (0 0 0.1)
    (1 0 0.1)
    (1 1 0.1)
    (0 1 0.1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (80 80 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    frontAndBack
    {
        type wall;
        faces
        (
            (0 1 5 4)
            (2 3 7 6)
        );
    }

    topAndBottom
    {
        type wall;
        faces
        (
            (4 5 6 7)
            (3 2 1 0)
        );
    }

    hot
    {
        type wall;
        faces
        (
            (6 5 1 2)
        );
    }

    cold
    {
        type wall;
        faces
        (
            (4 7 3 0)
        );
    }
);

mergePatchPairs
(
);
