tests/pure_openfoam_cases/cbox/sim0/system/solverInfo
// -*- C++ -*-

#includeEtc "caseDicts/postProcessing/numerical/solverInfo.cfg"

writeControl writeTime;

fields      (p_rgh);

writeFields yes;
